#todo: Дан массив размера N. Найти минимальное растояние между одинаковыми значениями в массиве и вывести их индексы.
# Одинаковых значение может быть два и более !
# Пример:
# mass = [1,2,17,54,30,89,2,1,6,2]

# Для числа 1 минимальное растояние в массиве по индексам: 0 и 7
# Для числа 2 минимальное растояние в массиве по индексам: 6 и 9
# Для числа 17 нет минимального растояния т.к элемент в массиве один.

mass = [1,2,17,54,30,89,2,1,6,2]

result = {}
for i in range(len(mass)):
    for j in range(i + 1, len(mass)):
        if mass[i] == mass[j]:
            dist = j - i
            if mass[i] not in result or dist < result[mass[i]][0]:
                result[mass[i]] = (dist, i, j)

for value in result:
    print(f"{value}: ind1 = {result[value][1]}, ind2 = {result[value][2]}")
